{
    "What has to be broken before you can use it?": "egg",
    "Im tall when Im young, and Im short when Im old. What am I?": "candle",
    "What month of the year has 28 days?": "All of them",
    "What is full of holes but still holds water?": "sponge",
    "What question can you never answer yes to?": "Are you asleep yet?",
    "What is always in front of you but cant be seen?": "future",
    "Theres a one-story house in which everything is yellow. Yellow walls, yellow doors, yellow furniture. What color are the stairs?": "There arent anyits one-story house.",
    "What can you break, even if you never pick it up or touch it?": "promise",
    "What goes up but never comes down?": "Your age",
    "A man who was outside in the rain without an umbrella or hat didnt get a single hair on his head wet. Why?": "He was bald.",
    "What gets wet while drying?": "towel",
    "What can you keep after giving to someone?": "Your word",
    "I shave every day, but my beard stays the same. What am I?": "barber",
    "You see a boat filled with people, yet there isnt a single person on board. How is that possible?": "All people on boat are married.",
    "You walk into a room that contains a match, a kerosene lamp, a candle and a fireplace. What would you light first?": "match",
    "A man dies of old age on his 25 birthday. How is this possible?": "He was born on February 29.",
    "I have branches, but no fruit, trunk or leaves. What am I?": "bank",
    "What cant talk but will reply when spoken to?": "echo",
    "The more of this there is, the less you see. What is it?": "Darkness",
    "Davids parents have three sonsSnap, Crackle, and whats the name of the third son?": "David",
    "I follow you all the time and copy your every move, but you cant touch me or catch me. What am I?": "Your shadow",
    "What has many keys but cant open a single lock?": "piano",
    "What can you hold in your left hand but not in your right?": "Your right elbow",
    "What is black when its clean and white when its dirty?": "chalkboard",
    "What gets bigger when more is taken away?": "hole",
    "Im light as a feather, yet the strongest person cant hold me for five minutes. What am I?": "Your breath",
    "Im found in socks, scarves and mittens; and often in the paws of playful kittens. What am I?": "Yarn",
    "Where does today come before yesterday?": "dictionary",
    "What invention lets you look right through a wall?": "window",
    "If youve got me, you want to share me; if you share me, you havent kept me. What am I?": "secret",
    "What cant be put in a saucepan?": "Its lid",
    "What goes up and down but doesnt move?": "staircase",
    "If youre running in a race and you pass the person in second place, what place are you in?": "Second place",
    "It belongs to you, but other people use it more than you do. What is it?": "Your name",
    "What has lots of eyes, but cant see?": "potato",
    "What has one eye, but cant see?": "needle",
    "What has many needles, but doesnt sew?": "Christmas tree",
    "What has hands, but cant clap?": "clock",
    "What has legs, but doesnt walk?": "table",
    "What has one head, one foot and four legs?": "bed",
    "What can you catch, but not throw?": "cold",
    "What kind of band never plays music?": "rubber band",
    "What has many teeth, but cant bite?": "comb",
    "What is cut on a table, but is never eaten?": "deck of cards",
    "What has words, but never speaks?": "book",
    "What runs all around a backyard, yet never moves?": "fence",
    "What can travel all around the world without leaving its corner?": "stamp",
    "What has a thumb and four fingers, but is not a hand?": "glove",
    "What has a head and a tail but no body?": "coin",
    "Where does one wall meet the other wall?": "On corner",
    "What building has the most stories?": "library",
    "What tastes better than it smells?": "Your tongue",
    "What has 13 hearts, but no other organs?": "deck of cards",
    "It stalks the countryside with ears that cant hear. What is it?": "Corn",
    "What kind of coat is best put on wet?": "coat of paint",
    "What has a bottom at the top?": "Your legs",
    "What has four wheels and flies?": "garbage truck",
    "I am an odd number. Take away a letter and I become even. What number am I?": "Seven",
    "If twos company, and threes a crowd, what are four and five?": "Nine",
    "What three numbers, none of which is zero, give the same result whether theyre added or multiplied?": "One, two and three",
    "Mary has four daughters, and each of her daughters has a brother. How many children does Mary have?": "Fiveeach daughter has same brother.",
    "Which is heaviera ton of bricks or a ton of feathers?": "Neitherthey both weigh ton.",
    "Three doctors said that Bill was their brother. Bill says he has no brothers. How many brothers does Bill actually have?": "None. He has three sisters.",
    "Two fathers and two sons are in a car, yet there are only three people in the car. How?": "They are grandfather, father and son.",
    "The day before yesterday I was 21, and next year I will be 24. When is my birthday?": "December 31; today is January 1.",
    "A little girl goes to the store and buys one dozen eggs. As she is going home, all but three break. How many eggs are left unbroken?": "Three",
    "A man describes his daughters, saying, They are all blonde, but two; all brunette but two; and all redheaded but two. How many daughters does he have?": "Three: blonde, brunette and redhead",
    "If there are three apples and you take away two, how many apples do you have?": "You have two apples.",
    "A girl has as many brothers as sisters, but each brother has only half as many brothers as sisters. How many brothers and sisters are there in the family?": "Four sisters and three brothers",
    "What five-letter word becomes shorter when you add two letters to it?": "Short",
    "What begins with an e and only contains one letter?": "envelope",
    "A word I know, six letters it contains, remove one letter;and 12 remains. What is it?": "Dozens",
    "What would you find in the middle of Toronto?": "letter o",
    "You see me once in June, twice in November and not at all in May. What am I?": "letter e",
    "Two in a corner, one in a room, zero in a house, but one in a shelter. What is it?": "letter r",
    "I am the beginning of everything, the end of everywhere. Im the beginning of eternity, the end of time and space. What am I?": "Also letter e",
    "What 4-letter word can be written forward, backward or upside down, and can still be read from left to right?": "NOON",
    "Forward I am heavy, but backward I am not. What am I?": "word not",
    "What is 3/7 chicken, 2/3 cat and 2/4 goat?": "Chicago",
    "I am a word of letters three; add two and fewer there will be. What word am I?": "Few",
    "What word of five letters has one left when two are removed?": "Stone",
    "What is the end of everything?": "letter g",
    "What word is pronounced the same if you take away four of its five letters?": "Queue",
    "I am a word that begins with the letter i. If you add the letter a to me, I become a new word with a different meaning, but that sounds exactly the same. What word am I?": "Isle (add a to make aisle)",
    "What word in the English language does the followingThe first two letters signify a male, the first three letters signify a female, the first four letters signify a great, while the entire world signifies a great woman. What is the word?": "Heroine",
    "What is so fragile that saying its name breaks it?": "Silence.",
    "What can run but never walks, has a mouth but never talks, has a head but never weeps, has a bed but never sleeps?": "river",
    "Speaking of rivers, a man calls his dog from the opposite side of the river. The dog crosses the river without getting wet, and without using a bridge or boat. How?": "river was frozen.",
    "What can fill a room but takes up no space?": "Light",
    "If you drop me Im sure to crack, but give me a smile and Ill always smile back. What am I?": "mirror",
    "The more you take, the more you leave behind. What are they?": "Footsteps",
    "I turn once, what is out will not get in. I turn again, what is in will not get out. What am I?": "key",
    "People make me, save me, change me, raise me. What am I?": "Money",
    "What breaks yet never falls, and what falls yet never breaks?": "Day, and night",
    "What goes through cities and fields, but never moves?": "road",
    "I am always hungry and will die if not fed, but whatever I touch will soon turn red. What am I?": "Fire",
    "The person who makes it has no need of it; the person who buys it has no use for it. The person who uses it can neither see nor feel it. What is it?": "coffin",
    "A man looks at a painting in a museum and says, Brothers and sisters I have none, but that mans father is my fathers son. Who is in the painting?": "mans son",
    "With pointed fangs I sit and wait; with piercing force I crunch out fate; grabbing victims, proclaiming might; physically joining with a single bite. What am I?": "stapler",
    "I have lakes with no water, mountains with no stone and cities with no buildings. What am I?": "map",
    "What does man love more than life, hate more than death or mortal strife; that which contented men desire; the poor have, the rich require; the miser spends, the spendthrift saves, and all men carry to their graves?": "Nothing"
}