{
    "Carl is trying to find solutions to a geometric puzzle. He has a square plot of land that he needs to reserve 1/4 for himself and divide the remaining 3/4 equally and in similar shape, among his 4 children. There are two possible solutions. Can you solve the puzzle?": "Squares",
    "Romeo and Juliet are found dead on the floor in a bedroom. When they were discovered, there were pieces of glass and some water on the floor. The only furniture in the room is a shelf and a bed. The house is in a remote location, away from everything except for the nearby railroad track. What caused the death of Romeo and Juliet?": "Romeo and Juliet are fish. rumble of train knocked tank off shelf, it broke and Romeo and Juliet did not survive.",
    "There are 20 people in an empty, square room. Each person has full sight of the entire room and everyone in it without turning his head or body, or moving in any way (other than the eyes). Where can you place an apple so that all but one person can see it?": "Place apple on one person's head.",
    "In the NBA, how many men are on the basketball court for each team?": "Five, not ten!",
    "A boy was at a carnival and went to a booth where a man said to the boy, \"If I write your exact weight on this piece of paper then you have to give me $50, but if I cannot, I will pay you $50.\" The boy looked around and saw no scale so he agrees, thinking no matter what the carny writes he'll just say he weighs more or less. In the end the boy ended up paying the man $50. How did the man win the bet?": "mdid exactly as he said he would and wrote \"your exact weight\" on paper.",
    "What is black when you buy it, red when you use it, and gray when you throw it away?": "Charcoal.",
    "What is it that when you take away the whole, you still have some left over?": "Wholesome!",
    "I'm in the book, but not on any leaf; I'm in the mouth, but not in lip or teeth; I'm in the atmosphere, but never in the air; I wait on every one, but never on a pair; I am with you wherever you may go; And every thing you do I&rsquo;m sure to know; Though when you did it I should not be there, Yet when &rsquo;twas done, you&rsquo;d find me in the chair.What am I?": "letter \"O\".",
    "Can you name three consecutive days without using the words Monday, Tuesday, Wednesday, Thursday, Friday, Saturday, or Sunday?": "Yesterday, Today, and Tomorrow.",
    "I'm as small as an ant, as big as a whale. I'll approach like a breeze, but can come like a gale. By some I get hit, but all have shown fear. I'll dance to the music, though I can't hear. Of names I have many, of names I have one. I'm as slow as a snail, but from me you can't run. What am I?": "I am shadow."
}{
    "Read my riddle, I pray. What God never sees, what the king seldom sees, and what we see every day. What is it?": "equal.",
    "What can be heard and caught but never seen?": "Remark.",
    "Many things can create one, it can be of any shape or size, it is created for various reasons, and it can shrink or grow with time. What is it?": "Hole",
    "They have not flesh, nor feathers, nor scales, nor bone. Yet they have fingers and thumbs of their own. What are they?": "Gloves.",
    "Not born, but from a Mother's body drawn, I hang until half of me is gone. I sleep in a cave until I grow old, then valued for my hardened gold. What am I?": "Cheese.",
    "Black I am and much admired, men seek me until they're tired. When they find me, they break my head, and take from me my resting bed. What am I?": "Coal",
    "This is as light as a feather, yet no man can hold it for long. What am I?": "Your Breath.",
    "I am not alive, but I grow; I don't have lungs, but I need air; I don't have a mouth, but water kills me. What am I?": "Fire.",
    "A very pretty thing am I, fluttering in the pale-blue sky. Delicate, fragile on the wing, indeed I am a pretty thing. What am I?": "I am Butterfly.",
    "I was carried into a dark room, and set on fire. I wept, and then my head was cut off. What am I?": "Candle."
}{
    "Mountains will crumble and temples will fall, and no man can survive its endless call. What is it?": "Time.",
    "This old one runs forever, but never moves at all. He has not lungs nor throat, but still a mighty roaring call. What is it?": "Waterfall.",
    "What can go up a chimney down, but cannot go down a chimney up?": "umbrella.",
    "I pass before the sun, yet make no shadow. What am I?": "wind.",
    "No sooner spoken than broken. What is it?": "Silence",
    "I killed one fourth of all mankind. Who am I?": "Cain (who killed Abel).",
    "Why are your nose and chin always at variance?": "Because words are passing between them.",
    "It speaks with a hard tongue, it cannot breathe, for it has no lung. What is it?": "Bell.",
    "Why ought a fisherman to be very wealthy?": "Because his is all",
    "A man and a woman were driving in their car when it broke down. The man decided to go for help at a gas station a few miles back. He made sure nobody was in the car, rolled all the windows up, and locked all of the sedan's doors. He went off, but when he came back, his wife was dead, and there was a stranger in the car. No physical damage was done to the car, so how did the stranger get in?": "stranger was baby and womdied in childbirth."
}{
    "How high would you have to count before you would use the letter A in the English language spelling of a whole number.": "One thousand.",
    "What relation would your father's sister's sister-in-law be to you?": "What relation would your father's sister's sister-in-law be to you?",
    "If you're 8 feet away from a door and with each move you advance half the distance to the door. How many moves will it take to reach the door?": "This person would be your mother.",
    "Samuel was out for a walk when it started to rain. He did not have an umbrella and he wasn't wearing a hat. His clothes were soaked, yet not a single hair on his head got wet. How could this happen?": "Infinity! Technically you will never reach door, as you conly move half distance, no matter how small.",
    "There is an ancient invention, still used in some parts of the world today, that allows people to see through walls. What is it?": "This mis bald!",
    "Tom and his younger sister were fighting. Their mother was tired of the fighting and decided to punish them by making them stand on the same piece of newspaper in such a way that they couldn't touch each other. How did she accomplish this?": "window.",
    "The 22nd and 24th presidents of the United States of America had the same parents, but were not brothers. How can this be possible?": "Tom's mother slid newspaper under door, each sibling standing on each side.",
    "I am a rock group that has 4 members, all of whom are dead, one of which was assasinated. What am I?": "They were same man. Grover Cleveland served two terms as president of United States, but terms were not consecutive.",
    "The answer I give is yes, but what I mean is no. What was the question?": "Mount Rushmore.&nbsp; Get it, rock group?"
}{
    "Give me an x, I'll stand to face you. Give me a cross, I'll turn my back on you. What am I?": "Number 9 (9 multipled by 9 = 81, 9 plus 9=18).",
    "I have a heart that never beats, I have a home but I never sleep. I can take a mans house and build anothers, And I love to play games with my many brothers. I am a king among fools. Who am I?": "King of Hearts in deck of cards.",
    "With pointed fangs it sits in wait, With piercing force its doles out fate, Over bloodless victims proclaiming its might, Eternally joining in a single bite. What am I?": "I'm Stapler.",
    "A man goes out drinking every night, returning to his home in the wee hours of every morning. No matter how much he drinks, he never gets a hangover. This drink is very well known, but is rarely consumed, served warm and taken straight from its source. The man is a sucker for a free drink, especially since he can't live without it. What is his favorite drink?": "Blood, he's vampire!",
    "When I point up it's bright, but when I point down it's dark. What am I?": "Light Switch.",
    "What is red and blue, and purple and green? No one can reach it, not even the queen?": "Rainbow.",
    "I can be cracked, I can be made. I can be told, I can be played. What am I?": "Joke!",
    "Four cars come to a four way stop, all coming from a different direction. They can't decide who got there first, so they all go forward at the same time. They do not crash into each other, but all four cars go. How is this possible?": "They all made right-hand turns.",
    "Where do Turkeys go to dance?": "Butter Ball.",
    "Farmer Brown came to town with some watermelons. He sold half of them plus half a melon, and found that he had one whole melon left. How many melons did he take to town?": "Three melons!"
}{
    "I cover what's real, hide what is true, but sometimes bring out the courage in you. What am I?": "Makeup.",
    "I have two arms, but fingers none. I have two feet, but cannot run. I carry well, but I have found I carry best with my feet OFF the ground. What am I?": "Wheelbarrow.",
    "Why is a man in debt like a misty morning?": "Because he is surrounded with dues (dews).",
    "I have a big mouth and I am also quite loud! I am NOT a gossip but I do get involved with everyone's dirty business. What am I?": "Vacuum Cleaner.",
    "It is said among my people that some things are improved by death. Tell me, what stinks while living, but in death, smells good?": "It is said among my people that some things are improved by death. Tell me, what stinks while living, but in death, smells good?",
    "What goes through the door without pinching itself? What sits on the stove without burning itself? What sits on the table and is not ashamed?": "Pig.",
    "I know a word of letters three. Add two, and fewer there will be. What is it?": "Sun.",
    "I give you a group of three. One is sitting down, and will never get up. The second eats as much as is given to him, yet is always hungry. The third goes away and never returns.": "I know word of letters three. Add two, and fewer there will be. What is it?"
}{
    "I build up castles. I tear down mountains. I make some men blind, I help others to see. What am I?": "I build up castles. I tear down mountains. I make some men blind, I help others to see. What am I?",
    "What does man love more than life Fear more than death or mortal strife What the poor have, the rich require, and what contented men desire, What the miser spends and the spendthrift saves And all men carry to their graves?": "I am Sand.",
    "Lovely and round, I shine with pale light, grown in the darkness, A lady's delight. What am I?": "Nothing.",
    "At the sound of me, men may dream, Or stamp their feet. At the sound of me, women may laugh, Or sometimes weep. What am I?": "Pearl.",
    "You can see nothing else When you look in my face, I will look you in the eye and I will never lie. What am I?": "I am Music!",
    "Three lives have I. Gentle enough to soothe the skin, Light enough to caress the sky, Hard enough to crack rocks. What am I?": "I am your reflection.",
    "You heard me before, Yet you hear me again, Then I die, 'Till you call me again. What am I?": "I am Water.",
    "My life can be measured in hours, I serve by being devoured. Thin, I am quick. Fat, I am slow. Wind is my foe. What am I?": "I am echo."
}{
    "Lighter than what I am made of, More of me is hidden Than is seen.": "I am Iceberg.",
    "Until I am measured, I am not known. Yet how you miss me, When I have flown.\r\nWhat am I?": "I am Time.",
    "If a man carried my burden He would break his back. I am not rich, But leave silver in my track.": "I am Snail.",
    "I am only useful When I am full, Yet I am always Full of holes. What am I?": "I am Sponge.",
    "Whoever makes it, tells it not. Whoever takes it, knows it not. And whoever knows it wants it not.": "Whoever makes it, tells it not. Whoever takes it, knows it not. And whoever knows it wants it not.",
    "Two words, my answer is only two words. To keep me, you must give me.": "Counterfeit money.",
    "What gets wetter the more it dries?": "\"Your word\".",
    "If a fire hydrant has H2O inside, what does it have on the outside?": "towel."
}{
    "What's the difference between a jeweler and a jailer?": "jeweler sells watches and jailer watches cells.",
    "If you drop a yellow hat in the Red Sea, what does it become?": "Wet, duh!",
    "How could a cowboy ride into town on Friday, stay two days, and ride out on Friday?": "His horse is named Friday.",
    "What's as big as you are yet doesn't weigh an ounce?": "shadow.",
    "What kind of running means walking?": "Running out of gas!",
    "Dead on the field lie ten soldiers in white, felled by three eyes, black as night. What happened?": "Dead on field lie ten soldiers in white, felled by three eyes, black as night. What happened?",
    "What question can you never answer?": "strike was thrown in 10 pin bowling.",
    "What goes up when the rain comes down?": "\"What's it like to be dead?\"",
    "Walk on the living, they don't even mumble. Walk on the dead, they mutter and grumble. What are they?": "umbrella."
}{
    "If life gets tough, what do you have that you can always count on?": "Your fingers!",
    "What word contains all of the twenty six letters?": "Alphabet.",
    "How do you make \"one\" disappear?": "Add \"g\" and your Gone !",
    "What is it that you ought to keep after you have given it to someone else?": "promise, of course.",
    "What kind of coat can be put on only when wet?": "coat of paint!",
    "How many 1 foot by 1 foot bricks would it take to complete a building that's 20 feet long on all four sides and 20 feet high?": "Only one; last brick you put in will complete it.",
    "When you stop and look, you can always see me. If you try to touch you cannot feel me. I cannot move, but as you near me, I will move away from you. What am I?": "I am horizon.",
    "There was a man who was born before his father, killed his mother, and married his sister. Yet, there was nothing wrong with what he had done. Why?": "His father was in front of him when he was born, therefore he was born before him. His mother died while giving birth to him. Finally, he grew up to be minister and married his sister at her ceremony.",
    "What 4-letter word can be written forward, backward or upside down, and can still be read from left to right?": "NOON.",
    "You are in a room that is completely bricked in on all four sides, including the ceiling and floor. You have nothing but a mirror and a wooden table in the room with you. How do you get out?": "You look in mirror you see what you saw, you take saw and you cut table in half, two halves make whole, and you climb out hole."
}{
    "A man was found dead out in a field of snow. The only tracks that were left was a set of footprints between two parallel lines. Who should the police be looking for?": "min wheelchair.",
    "A large truck is crossing a bridge 1 mile long. The bridge can only hold 14000 lbs, which is the exact weight of the truck. The truck makes it half way across the bridge and stops. A bird lands on the truck. Does the bridge collapse?": "large truck is crossing bridge 1 mile long. bridge conly hold 14000 lbs, which is exact weight of truck. truck makes it half way across bridge and stops. bird lands on truck. Does bridge collapse?",
    "Does the law allow a man to marry his widow's sister?": "No, it does not collapse. Because it has driven half mile - you would subtract gas used from total weight of truck.",
    "The rungs of a 10 foot ladder attached to a ship are 1 foot apart. If the water is rising at the rate of one foot an hour, how long will it take until the water covers over the ladder?": "Of course not. If he has widow then he's dead. And dead people can't get married.",
    "Two girls have the same parents and were born at the same hour of the same day of the same month, but they are not twins. How can this be possible?": "rungs of 10 foot ladder attached to ship are 1 foot apart. If water is rising at rate of one foot hour, how long will it take until water covers over ladder?",
    "A sign on the barber's door says \"I shave only those who do not shave themselves\". Does the barber shave himself?": "It will never cover ladder because as water rises, so will floating ship.",
    "A train just leaves a station and enters a tunnel. Where is the best place for a claustrophobic person to sit?": "They were not born in same year.",
    "The marathon man timed himself and found out that if he wore a bright white outfit he ran 20 miles in 80 minutes, but when he wore a dark outfit, he ran 20 miles in one hour and twenty minutes. What does this mean for his next race?": "There is no answer; it's paradox. It cannot be made to work."
}{
    "Which clock works best, the one that loses a minute a day, or the one that doesn't work at all?": "one that doesn't work is best as it will always be correct twice day, but one that loses minute day will not be correct again for 720 days (losing 720 minutes or 12 hours).",
    "If you toss a die and it comes up with the number one 9 times in a row, what is the probability that it will come up with one on the next throw?": "One in six. die has no memory of what it last showed.",
    "A pregnant lady named her children: Dominique, Regis, Michelle, Fawn, Sophie and Lara. What will she name her next child? Jessica, Katie, Abby or Tilly?": "Tilly. She seems to follow scale Do, Re, Me, Fa, So, La, and then Ti.",
    "A woman was horrified to find a fly in her tea. The waiter took her cup and went into the kitchen and returned with a fresh cup of tea. She shouted, \"You brought me the same tea!\" How did she know?": "She had already put sugar in it and when she tasted new teit was already sweet.",
    "A pet shop owner had a parrot with a sign on its cage that said \"Parrot repeats everything it hears.\" A young man bought the parrot and for two weeks he spoke to it and it didn't say a word. He returned the parrot but the shopkeeper said he never lied about the parrot. How can this be?": "parrot was deaf!",
    "Which word in the English language becomes shorter when it is lengthened?": "Short.",
    "If you have three oranges and you take away two, how many will you have?": "Two. two you took.",
    "The following sentence is false. The preceding sentence is true. Are these sentences true or false?": "Neither, it's paradox. If first is true, then second must be false, which makes first false; it doesn't work.",
    "You give someone a dollar. You are this person's brother, but the person is not your brother. How can that be?": "It's your sister!"
}{
    "A clock chimes 5 times in 4 seconds. How many times will it chime in 10 seconds?": "11 times. It chimes at zero and then once every second for 10 seconds.",
    "A murderer is condemned to death. He has to choose between three rooms. The first is full of raging fires, the second is full of assassins with loaded guns, and the third is full of lions that haven't eaten in 3 years. Which room is safest for him?": "third. Lions that haven't eaten in three years are dead.",
    "What is the difference between a dollar and a half and thirty five-cents?": "Nothing. dollar and half is same as thirty five-cents (nickels). But not same as thirty-five cents.",
    "An archaeologist finds a coin dated 48 B.C. How did he know it was a fake?": "BC is before Christ. Christ was not yet born when coin would have been made and date would be impossible.",
    "What was the biggest island in the world before the discovery of Australia by Captain Cook?": "Australiwas always biggest island in world, even before it was discovered.",
    "A rubber ball is tossed off the top of a 90 foot building. Every time it bounces, it goes back up half way. How many bounces will the ball take before it stops?": "answer is infinite, in gravity free world. But of course gravity will eventually stop it.",
    "What's the least number of chairs you would need around a table to sit four fathers, two grandfathers, and four sons?": "Four. four fathers could be grandfathers and are definitely sons already.",
    "What is significant about 3661 seconds past midnight on 1st January 2001?": "time and date will be 01:01:01 on 01/01/01.",
    "Look at me. I can bring a smile to your face, A tear to your eye, Or even a thought to your mind. But, I can't be seen. What am I?": "Your Memories.",
    "You do not want to have it, But when you do have it, You do not want to lose it. What is it?": "lawsuit."
}{
    "No legs have I to dance, No lungs have I to breathe, No life have I to live or die And yet I do all three. What am I?": "I am Fire.",
    "What goes up and never comes down?": "Your Age.",
    "My first is often at the front door. My second is found in the cereal family. My third is what most people want. My whole is one of the United States. What am I?": "MATRIMONY (mat rye money). Which is certainly \"united state\"!",
    "One word in this sentence is misspelled. What word is it?": "MISSPELLED. It isn't spelled wrong, one word in this sentence IS \"misspelled.\"",
    "Three playing cards in a row. Can you name them with these clues? There is a two to the right of a king. A diamond will be found to the left of a spade. An ace is to the left of a heart. A heart is to the left of a spade. Now, identify all three cards.": "Ace of Diamonds, King of Hearts, Two of Spades.",
    "If a man carried my burden he would break his back. I am not big but leave silver in my tracks. What am I?": "snail.",
    "Two mothers and two daughters go shopping. They have $21, which they split equally between them. How can this be possible?": "There are only three people. One of mothers is daughter also, because there is grandmother, mother and daughter! They each get $7 exactly.",
    "There is a frog, dead in the middle of an island. If he swims north, the distance to the mainland is 2 meters. If he swims south, the distance to the mainland is 3 meters. If he swims east or west, the distance is 4 meters. Which way does he swim?": "He doesn't swim at all, he is dead.",
    "What is more useful when it is broken?": "egg.",
    "There are two bodies on the floor. They are surrounded by water and broken glass. How did they die?": "fish bowl got knocked over. bodies were goldfish."
}{
    "Two fathers and two sons went fishing one day. They were there the whole day and only caught 3 fish. One father said, that is enough for all of us, we will have one each. How can this be possible?": "There was father, his son, and his son's son. This equals 2 fathers and 2 sons for total of 3!",
    "Two men are in a desert. They both have packs on. One of the guys is dead. The guy who is alive has his pack open, the guy who is dead has his pack closed. What is in the pack?": "parachute (that didn't open)",
    "Alice is walking throught the forest of forgetfulness. She wants to know what day of the week it is. She stops and asks a lion and a unicorn. Now the lion lies all of the time on Monday, Tuesday, and Wednesday. The unicorn always lies on Thursday, Friday and Saturday. Alice asks the lion what day it is, he says, \"Well, yesterday was one of my lying days.\" Alice can't figure it out just from the lion's answer so she asks the unicorn and the unicorn says, \"Yesterday was also one of my lying days.\" What day is it?": "Thursday.",
    "There once was an evil wizard. He took 3 woman from their homes and turned them into rose bushes that looked exactly alike. He put them in his garden. One of the woman had a husband and children and begged the wizard to let her see them. He agreed. At night, he brought the woman to her house. In the morning he came and took her home. One day the husband decided to go rescue her. So he snuck into the wizard's garden. He looked and looked at the 3 identical rose bushes trying to figure out which could be his wife. Suddenly, he knew the answer and he took his wife home. How did he know which rose bush was his wife?": "wizard brought rosebush to her home at night and returned her to garden in morning. Therefore, she was only plant without dew.",
    "You have three stoves: a gas stove, a wood stove, and a coal stove, but only one match. Which should you light first?": "match!",
    "You live in a one story house made entirely of redwood. What color would the stairs be?": "What stairs? You live in one-story house.",
    "What is round on the ends and high in the middle?": "oHIo.",
    "Almost everyone sees me without noticing me, For what is beyond is what he or she seeks. What am I?": "Almost everyone sees me without noticing me, For what is beyond is what he or she seeks. What am I?",
    "I am the fountain from which no one can drink. For many I am considered a necessary link. Like gold to all I am sought for, But my continued death brings wealth for all to want more. What am I?": "window."
}{
    "I'm so fast you can't see me, Though everyone sees straight through me, I don't stop until the day you die. What am I?": "I'm so fast you can't see me, Though everyone sees straight through me, I don't stop until day you die. What am I?",
    "I am served at a table, In gatherings of two or four; Served small, white and round. You'll love some, And that's part of the fun. What am I?": "blink of eye.",
    "A sharpshooter hung up his hat and put on a blindfold. He then walked 100 yards, turned around, and shot a bullet through his hat. The blindfold was a perfectly good one, completely blocking the man's vision. How did he manage this?": "Ping Pong Balls.",
    "A man was shot to death while in his car. There were no powder marks on his clothing, which indicated that the gunman was outside the car. However, all the windows were up and the doors locked. After a close inspection was made, the only bullet-holes discovered were on the man's body. How was he murdered?": "sharpshooter hung up his hat and put on blindfold. He then walked 100 yards, turned around, and shot bullet through his hat. blindfold was perfectly good one, completely blocking man's vision. How did he manage this?",
    "The king dies and two men, the true heir and an impostor, both claim to be his long-lost son. Both fit the description of the rightful heir: about the right age, height, coloring and general appearance. Finally, one of the elders proposes a test to identify the true heir. One man agrees to the test while the other flatly re-fuses. The one who agreed is immediately sent on his way, and the one who re-fused is correctly identified as the rightful heir. Can you figure out why?": "He hung is hat on barrel of his gun.",
    "You heard me before, Yet you hear me again. Then I die, 'Til you call me again What am I?": "victim was in convertible. He was shot when top was down."
}{
    "I turn around once. What is out will not get in. I turn around again. What is in will not get out. What am I?": "Key.",
    "Until I am measured, I am not known. Yet how you miss me, When I have flown. What am I?": "Time.",
    "Which bird does not belong in this group? Finch, gull, eagle, ostrich, or sparrow?": "Ostrich. It's only bird that doesn't fly.",
    "A car's odometer shows 72927 miles, a palindromic number. What are the minimum miles you would need to travel to form another?": "110 miles. (73037)",
    "What word starting with BR, that with the addition of the letter E, becomes another word that sounds the same as the first?": "Braking becomes Breaking.",
    "Where on Earth do the winds always blow from the South?": "North Pole.",
    "What word doesn't belong in this group? That, hat, what, mat, cat, sat, pat, or chat?": "What. It's pronounced differently; all of others rhyme.",
    "Which word can be placed between the two following words to make two new ones: TABLE - - - - HOUSE": "WARE.",
    "How many letters are in the alphabet?": "There are 11 letters in \"ALPHABET.\" Did you say 26?",
    "What can you catch but not throw?": "cold."
}{
    "A certain crime is punishable if attempted but not punishable if committed. What is it?": "Suicide.",
    "You use a knife to slice my head and weep beside me when I am dead. What am I?": "onion.",
    "I'm the part of the bird that's not in the sky. I can swim in the ocean and yet remain dry. What am I?": "shadow.",
    "I am weightless, but you can see me. Put me in a bucket, and I'll make it lighter. What am I?": "hole.",
    "I never was, am always to be, No one ever saw me, nor ever will, And yet I am the confidence of all To live and breathe on this terrestrial ball. What am I?": "Tomorrow.",
    "Pronounced as one letter, And written with three, Two letters there are, And two only in me. I'm double, I'm single, I'm black, blue, and gray, I'm read from both ends, And the same either way. What am I?": "eye.",
    "From the beginning of eternity To the end of time and space To the beginning of every end And the end of every place. What am I?": "letter 'e'.",
    "All about, but cannot be seen, Can be captured, cannot be held, No throat, but can be heard. What is it?": "wind.",
    "Whoever makes it, tells it not. Whoever takes it, knows it not. Whoever knows it, wants it not. What is it?": "Counterfeit money.",
    "What does man love more than life? Fear more than death or mortal strife? What do the poor have, what the rich require, And what contented men desire? What does the miser spend, the spendthrift save, And all men carry to their graves?": "Nothing."
}{
    "My thunder comes before the lightning; My lightning comes before the clouds; My rain dries all the land it touches. What am I?": "volcano.",
    "What can run but never walks, has a mouth but never talks, has a head but never weeps, has a bed but never sleeps?": "river.",
    "What gets whiter the dirtier that it gets?": "chalkboard.",
    "What has no beginning, end, or middle?": "doughnut.",
    "What's the greatest worldwide use of cowhide?": "To cover cows.",
    "A skin have I, more eyes than one. I can be very nice when I am done. What am I?": "potato.",
    "He has married many women, but has never been married. Who is he?": "preacher.",
    "Big as a biscuit, deep as a cup, even a river can't fill it up. What is it?": "kitchen strainer.",
    "How many times can you subtract the number 5 from 25?": "Once, because after you subtract it's not 25 anymore.",
    "If a rooster laid a brown egg and a white egg, what kind of chicks would hatch?": "Roosters don't lay eggs."
}{
    "The more you take, the more you leave behind. What are they?": "Footprints.",
    "What can go up and come down without moving?": "temperature.",
    "What do you serve that you can't eat?": "tennis ball.",
    "What starts with a T, ends with a T and has T in it?": "teapot.",
    "Which is correct to say, \"The yolk of the egg are white,\" or \"The yolk of the egg is white?\"": "Neither, because egg yolks are yellow.",
    "You can't keep this until you have given it. What is it?": "Your word.",
    "What question can someone ask all day long, always get completely different answers, and yet all the answers could be correct?": "\"What time is it?\"",
    "In a certain city, 5% of all the persons in town have unlisted phone numbers. If you select 100 names at random from that city's phone directory, how many people selected will have unlisted phone numbers?": "None. If their names are in phone directory, they do not have unlisted phone numbers!",
    "Who can shave three times a day and still grow a beard?": "barber, He could shave other men three times day and still grow his own beard.",
    "David's father has three sons: Snap, Crackle, and _____?": "David."
}{
    "What is harder to catch the faster you run?": "Your breath!",
    "A hundred feet in the air, but it's back is on the ground. What is it?": "centipede flipped over.",
    "What kind of coat can be put on only when wet?": "coat of paint.",
    "What object has keys that open no locks, space but no room, and you can enter but not go in?": "computer keyboard.",
    "What is once in a minute, twice in a moment, and never in a thousand years?": "letter M.",
    "If a train was on its way to Florida and it tipped over, where would they bury the survivors?": "They wouldn't need to, survivors are still alive!",
    "What can be swallowed, but can also swallow you?": "Pride.",
    "What two things can you never eat for breakfast?": "Lunch and dinner.",
    "While on my way to St. Ives, I saw a man with 7 wives. Each wife had 7 sacks. Each sack had 7 cats. Each cat had 7 kittens. Kitten, cats, sacks, wives, How many were going to St. Ives?": "Just one, me.",
    "What never gets any wetter, no matter how much it rains?": "sea."
}{
    "I am large as a castle, yet lighter than air. 100 men and their horses cannot move me. What am I?": "castle's shadow.",
    "My voice is tender, my waist is slender and I'm often invited to play. Yet wherever I go I must take my bow or else I have nothing to say. What am I?": "violin.",
    "I was born in the 18th century, yet still live on today. Appearing on TV when I have something to say. Called everything from \"honest\" to a dirty rotten \"crook\", I used to wear a wig, but have had several looks. I've always had a party, but never disturb the neighbors. I've been shot at many times - major stories for the papers. What am I?": "Office of President of United States.",
    "What is put on a table, cut, but never eaten?": "deck of cards.",
    "Some try to hide, some try to cheat, but time will show, we always will meet. Try as you might, to guess my name, I promise you'll know, when you I do claim. Who am I?": "Death.",
    "Inside a burning house, this thing is best to make. And best to make it quickly, before the fire's too much to take! What is it?": "Haste!",
    "A farmer in California owns a beautiful pear tree. He supplies the fruit to a nearby grocery store. The store owner has called the farmer to see how much fruit is available for him to purchase. The farmer knows that the main trunk has 24 branches. Each branch has exactly 12 boughs and each bough has exactly 6 twigs. Since each twig bears one piece of fruit, how many plums will the farmer be able to deliver?": "farmer in Californiowns beautiful pear tree. He supplies fruit to nearby grocery store. store owner has called farmer to see how much fruit is available for him to purchase. farmer knows that main trunk has 24 branches. Each branch has exactly 12 boughs and each bough has exactly 6 twigs. Since each twig bears one piece of fruit, how many plums will farmer be able to deliver?",
    "Different lights do make me strange, thus into different sizes I will change. What am I?": "None. pear tree does not bear plums.",
    "What always goes to bed with shoes on?": "I am pupil of eye."
}{
    "What can burn the eyes, sting the mouth, yet be consumed?": "Salt.",
    "Who is it that rows quickly with four oars but never comes out from under his own roof?": "Turtle.",
    "What is the difference between a school boy studying and a farmer watching his cattle?": "What is difference between school boy studying and farmer watching his cattle?",
    "What is it that is deaf, dumb and blind and always tells the truth?": "One is stocking his mind, while other is minding his stock.",
    "What has one foot on each side and one in the middle?": "Mirror.",
    "Here on earth it is true, yesterday is always before today; but there is a place where yesterday always follows today. Where?": "yardstick.",
    "At night they come without being fetched, And by day they are lost without being stolen. What are they?": "In dictionary!",
    "I never was, am always to be, No one ever saw me, nor ever will And yet I am the confidence of all To live and breathe on this terrestrial ball.": "stars.",
    "There was a green house. Inside the green house there was a white house Inside the white house there was a red house. Inside the red house there were lots of babies. What am I?": "I am tomorrow - your future."
}{
    "There is a word in the English language in which the first two letters signify a male, the first three letters signify a female, the first four signify a great man, and the whole word, a great woman. What is the word?": "Heroine.",
    "How many three cent stamps are in a dozen?": "dozen, although you probably said four.",
    "When John was six years old he hammered a nail into his favorite tree to mark his height. Ten years later at age sixteen, John returned to see how much higher the nail was. If the tree grew by five centimeters each year, how much higher would the nail be?": "nail would be at same height since trees grow at their tops.",
    "A beggar's brother died, but the man who died had no brother. How could this be?": "beggar was woman.",
    "What is bought by the yard and worn by the foot?": "Carpet.",
    "What is the value of 1/2 of 2/3 of 3/4 of 4/5 of 5/6 of 6/7 of 7/8 of 8/9 of 9/10 of 1,000?": "One hundred - work backwards and you will understand.",
    "What common English verb becomes its own past tense by rearranging its letters?": "Eat and Ate.",
    "I dig out tiny caves, and store gold and silver in them. I also build bridges of silver and make crowns of gold. They are the smallest you could imagine. Sooner or later everybody needs my help, yet many people are afraid to let me help them. Who am I?": "I am Dentist.",
    "How can you physically stand behind your friend as he physically stands behind you?": "By standing back to back.",
    "There is a clothing store in Bartlesville. The owner has devised his own method of pricing items. A vest costs $20, socks cost $25, a tie costs $15 and a blouse costs $30. Using the method, how much would a pair of underwear cost?": "$45. pricing method consists of charging $5 for each letter required to spell item."
}{
    "If three cats catch three mice in three minutes, how many cats would be needed to catch 100 mice in 100 minutes?": "same three cats would do. Since these three cats are averaging one mouse per minute, given 100 minutes, cats could catch 100 mice.",
    "Four men were in a boat on the lake. The boat turns over, and all four men sink to the bottom of the lake, yet not a single man got wet! Why?": "Because they were all married and not single.",
    "How many times can you subtract the number 5 from 25?": "Only one time. After that, you would be subtracting from 20.",
    "Dave and Brad, two popular politicians, met at a club to discuss the overthrow of their party leader. They each ordered a vodka on the rocks. Brad downed his and ordered another. He then drank his second in a gulp and decided to wait before he ordered a third. Meanwhile, Dave, who was sipping his drink, suddenly fell forward dead. Both men were setup for an assassination. Why did Dave die and Brad live?": "Both Dave and Brad were given drinks with poisoned ice cubes. Brad drank his drinks so quickly that ice didn't have time to melt and release poison.",
    "If a wheel has 64 spokes, how many spaces are there between the spokes?": "64. space that comes after 64th spoke, would be just before first spoke.",
    "When can you add two to eleven and get one as the correct answer?": "When you add two hours to eleven o'clock, you get one o'clock.",
    "Brad stared through the dirty soot-smeared window on the 22nd floor of the office tower. Overcome with depression he slid the window open and jumped through it. It was a sheer drop outside the building to the ground. Miraculously after he landed he was completely unhurt. Since there was nothing to cushion his fall or slow his descent, how could he have survived the fall?": "Brad was so sick and tired of window washing, he opened window and jumped inside.",
    "A black dog stands in the middle of an intersecton in a town painted black. None of the street lights are working due to a power failure caused by a storm. A car with two broken headlights drives towards the dog but turns in time to avoid hitting him. How could the driver have seen the dog in time?": "Who said this happened during night?",
    "Four men sat dawn to play, They played all night till break of day. They played for gold and not for fun, With separate scores for everyone. When they had come to square accounts, They all had made quite fair amounts. Can you the paradox explain, If no one lost, how all could gain?": "men were musicians..",
    "What is it the more you take, the more you leave behind?": "Footsteps."
}{
    "Be you ever so quick, with vision keen, by your eyes, we are never seen. Unless perchance it should come to pass, you see our reflection in a looking glass. What are we?": "Be you ever so quick, with vision keen, by your eyes, we are never seen. Unless perchance it should come to pass, you see our reflection in looking glass. What are we?",
    "You use it between your head and your toes, the more it works the thinner it grows. What is it?": "Your own eyes.",
    "What can bring back the dead; make us cry, make us laugh, make us young; born in an instant yet lasts a life time?": "Bar of Soap.",
    "Hands she has but does not hold, teeth she has but does not bite, feet she has but they are cold, eyes she has but without sight. Who is she?": "Memories.",
    "I make you weak at the worst of all times. I keep you safe, I keep you fine. I make your hands sweat, and your heart grow cold, I visit the weak, but seldom the bold. What am I?": "Doll.",
    "This thing runs but cannot walk, sometimes sings but never talks. Lacks arms, has hands; lacks a head but has a face. What is it?": "Your fears.",
    "Where will you find roads without cars, forests without trees and cities without houses?": "Clock.",
    "I have no voice and yet I speak to you, I tell of all things in the world that people do. I have leaves, but I am not a tree, I have pages, but I am not a bride or royalty. I have a spine and hinges, but I am not a man or a door, I have told you all, I cannot tell you more. What am I?": "On Map.",
    "Violet, indigo, blue and green, yellow, orange and red; these are the colors you have seen after the storm has fled. What am I?": "Book."
}{
    "In spring I am gay in handsome array; in summer more clothing I wear; when colder it grows I fling off my clothes; and in winter quite naked appear. What am I?": "Tree.",
    "It goes up, but at the same time goes down. Up toward the sky, and down toward the ground. It's present tense and past tense too, come for a ride, just me and you. What is it?": "See-Saw.",
    "Old Mother Twitchett had but one eye, and a long tail which she let fly; and every time she went through a gap, a bit of her tail she left in a trap. What is she?": "Old Mother Twitchett had but one eye, and long tail which she let fly; and every time she went through gap, bit of her tail she left in trap. What is she?",
    "Three mountain climbers paid a lot of money to be the first to scale a mountain. After several days of climbing they finally reached the pinnacle, and to their dismay, found a cabin and three frozen bodies. Since the mountain climbers were the first to ever climb the summit, how could this be possible?": "needle and thread.",
    "If you screw a light bulb into a socket by turning the bulb toward the right with your right hand, which way would you turn the socket with your left hand in order to unscrew it while holding the bulb stationary?": "They found cabin of airplane that had crashed there with 3 bodies in it.",
    "If someone says to you, \"I'll bet you $1 that if you give me $2, I will give you $3 in return\", would this be a good bet for you to accept?": "To right. It's always same direction.",
    "Never resting, never still. Moving silently from hill to hill. It does not walk, run or trot, All is cool where it is not. What is it?": "No. This is situation where you lose even if you win. Assuming other person is being wise, they would take your $2 and say, \"I lose\", and give you $1 in return. You win bet, but you're out $1.",
    "If you go to the movies and you're paying, is it cheaper to take one friend to the movies twice, or two friends to the movies at the same time?": "Sunshine.",
    "A tree doubled in height each year until it reached its maximum height over the course of ten years. How many years did it take for the tree to reach half its maximum height?": "It's cheaper to take two friends at same time. In this case, you would only be buying three tickets, whereas if you take same friend twice you are buying four tickets."
}{
    "Why are 1990 dollar bills worth more than 1989 dollar bills?": "same reason seven dollars is more thsix. Because there is one more.",
    "I am a word of five letters. Take away my first and I am the name of what adorns the estate of many of the nobility of England. Take away my first and second, and I am the name of a place where all the world was once congregated. Take away my last, and I am the name of a beautiful mineral. Take away my two last, and I am the name of a fashionable place of resort. I am small in stature, but capable of doing a great deal of mischief, as I once did in London in the year 1666.": "Spark.",
    "There are four girls, and four apples in a basket. Every girl takes an apple, yet one apple remains in the basket? How is this possible?": "answer is that one girl took basket. She took last apple while it was in basket.",
    "What goes around the world and stays in a corner?": "stamp.",
    "Take one out and scratch my head, I am now black but once was red. What am I?": "Match.",
    "How many of each type of animal did Moses take on the Ark?": "How many of each type of animal did Moses take on Ark?",
    "Two men were playing tennis. They played five sets and each man won three sets. How can this be possible?": "None, it was Noah.",
    "Some will use me, while others will not, some have remembered, while others have forgot. For profit or gain, I'm used expertly, I can't be picked off the ground or tossed into the sea. Only gained from patience and time, can you unravel my rhyme? What am I?": "two men were partners playing doubles.",
    "The more there is the less you see. What is it?": "I'm Knowledge."
}{
    "What demands an answer, but asks no question?": "Telephone.",
    "When asked how old she was, Suzie replied, \"In two years I will be twice as old as I was five years ago.\" How old is she?": "She's 12!",
    "Dark with white markings, And smooth like a rock. Where learning occurs, I help convey thought. What am I?": "Blackboard/chalkboard.",
    "What is the easiest way to throw a ball, and have it stop, and completely reverse direction after traveling a short distance?": "Toss it in air.",
    "I have four wings, but cannot fly, I never laugh and never cry; On the same spot I'm always found, toiling away with little sound. What am I?": "Windmill.",
    "I have many feathers to help me fly. I have a body and head, but I'm not alive. It is your strength which determines how far I go. You can hold me in your hand, but I'm never thrown. What am I?": "Arrow.",
    "You must keep this thing, its loss will affect your brothers. For once yours is lost, it will soon be lost by others. What is it?": "Your Temper.",
    "How far can a dog run into the woods?": "Halfway, any farther and he would be running out of woods.",
    "Something very extraordinary happened on the 6th of May, 1978 at 12:34 a.m. What was it?": "Something very extraordinary happened on 6th of May, 1978 at 12:34 a.m. What was it?"
}